//
//  DSManagerOfProperty.m
//  DSHomeworkSolop#1
//
//  Created by Дмитрий Солоп on 16.02.17.
//  Copyright © 2017 Dimon Solop. All rights reserved.
//

#import "DSManagerOfProperty.h"


@implementation DSManagerOfProperty

@dynamic firstName;
@dynamic lastName;
@dynamic alias;
@dynamic age;

- (instancetype)init
{
    self = [super init];
    if (self) {
        
        self.arrayBaseOfFirstName = [NSArray arrayWithObjects:
                                     @"Михаил", @"Николай", @"Дмитрий", @"Роман", @"Василий",
                                     @"Алексей", @"Максим", @"Евгений", @"Владимир", @"Андрей",@"Олег", @"Елисей",
                                     @"Александр", @"Илья", @"Тимофей", @"Матвей", @"Семен", @"Денис", @"Данила",
                                     @"Григорий", @"Руслан", @"Тимур", @"Юрий", @"Георгий", @"Давид",@"Ольга", @"Елена",
                                     @"Алена", @"Татьяна", @"Авдотья", @"Вераника", @"Галина", @"Ксения", @"Алла",
                                     @"Виола", @"Влада", @"Богдана", @"Валерия", @"Варвара", @"Дана", @"Джамиля",
                                     @"Жасмин", @"Диана", @"Екатерина", @"Жозефина", @"Илона", @"Ирма", @"Кристина",
                                     @"Клара", @"Лилия", nil];
        
        self.arrayBaseOfLastName = [NSArray arrayWithObjects:
                                    @"Солоп", @"Данченко", @"Клюйко", @"Запорожченко", @"Петренко", @"Андреенко",
                                    @"Руденко", @"Полищук", @"Бондарь", @"Бондаренко",@"Бондарчук", @"Захаренко",
                                    @"Захарченко", @"Юшко", @"Клименко", @"Макаренко", @"Макарченко", @"Чикотило",
                                    @"Махно", @"Николенко", @"Никольченко", @"Гончар", @"Гончаренко", @"Гончарук",
                                    @"Кравец", @"Кравченко", @"Кравчук", @"Гоголь", @"Горобец", @"Комар",
                                    @"Шевченко", @"Белоштан", @"Хрущ", @"Хрущов", @"Лещенко", @"Кобзон",
                                    @"Кривонос", @"Рябоконь", @"Подопригора", @"Вырвихвост", @"Непийвода",
                                    @"Миняйло", @"Колесниченко", @"Коваль", @"Коваленко", @"Ковальчук", @"Весна",
                                    @"Шумейко", @"Кличко", @"Марочко", nil];
        
        self.arrayBaseOfAlias = [NSArray arrayWithObjects:
                                 @"Гор", @"Акма", @"Азиза", @"Айна", @"Аджи", @"Алый", @"Багира", @"Бага", @"Бабо",
                                 @"Бафу", @"Бая", @"Блор", @"Вака", @"Визи", @"Вигри", @"Вуди", @"Вэсси", @"Вука",
                                 @"Дзинь", @"Даби", @"Даза", @"Дайка", @"Джери", @"Джесси", @"Динька", @"Дуди",
                                 @"Ева", @"Еви", @"Ейга", @"Екси", @"Жами", @"Жайма", @"Жалея", @"Жоли", @"Заби",
                                 @"Зайа", @"Иги", @"Идур", @"Игр", @"Женис", @"Диди", @"Пипа", @"Гебо", @"Амур",
                                 @"Атос", @"Брут" ,@"Грего", @"Асик", @"Биглс" ,@"Бонд", @"Араш", @"Том", @"Ник", nil];
        
    }
    return self;
}

- (NSString *)firstName {
    return [self.arrayBaseOfFirstName objectAtIndex:arc4random() % [self.arrayBaseOfFirstName count]];
}

- (NSString *)lastName {
    return [self.arrayBaseOfLastName objectAtIndex:arc4random() % [self.arrayBaseOfLastName count]];
}

- (NSString *)alias {
    return [self.arrayBaseOfAlias objectAtIndex:arc4random() % [self.arrayBaseOfAlias count]];
}

- (NSInteger) age {
    return arc4random() % 50 + 16;
}



@end
